Repository: KDE/kte-collaborative
Catalog: po/*/kobby.po
Languages: fr

source: Create Connection
fr: Créer une connexion

source: Kobby Settings
fr: Configuration pour Kobby

source: Profile
fr: Profil

source: Network
fr: Réseau

source: User Interface
fr: Interface d'utilisateur

source: Cannot open non-node item.
fr: Impossible d'ouvrir un élément qui n'est pas un nœud.

source: Session is not an InfText session. This usually means the connection is not using the kobby plugin.
fr: La session n'est pas une session InfText. Ceci veut habituellement dire que la connexion n'utilise pas le module Kobby.

source: Could not retrieve Kobby buffer from session. This usually means the connection is not using the kobby plugin.
fr: Impossible de récupérer le tampon Kobby de la session. Ceci signifie habituellement que la connexion n'utilise pas le module Kobby.

source: Joining failed:
fr: Échec de connexion:

source: Joining Failed
fr: Échec de connexion

source: Skipping empty insert.
fr: Ignore une entrée vide.

source: Got empty encoded text from non empty string Skipping insertion
fr: Reçu du texte encodé vide d'une insertion string qui n'est pas vide. Insertion ignoré

source: Document state compromised
fr: L'état du document est compromis

source: No encoder for text codec.
fr: Pas d'encodeur pour le codec de texte

source: Could not insert text: No local user set.
fr: Impossible d'insérer du text. Aucun utilisateur local de défini.

source: 0 legth delete operation. Skipping.
fr: Supprimation de longueur 0. Ignoré.

source: Could not remove text: No local user set.
fr: Impossible de supprimer le text: Aucun utilisateur local de définit.

source: Synchronization Failed:
fr: Échec de synchronization:

source: Could not join session:
fr: Impossible de se joindre à la session:

source: Join failed: %1
fr: Échec de connexion: %1

source: set undo %1
fr: activer annuler %1

source: Are you sure you want to close this document?
fr: Voulez-vous vraiment fermer ce document?

source: You are about to close %1 documents.
fr: Vous fermerez %1 documents.

source: Are you sure you want to do this?
fr: Voulez-vous vraiment faice ceci?

source: Row removed from document model not of DocumentItem type!
fr: Rangé suppriment du modèle document n'était pas du type DocumentItem!

source: You must be editing a collaborative document to see active users.
fr: Vous devez être en train de modifier un document collaboratif afin de voir les utilisateurs actifs.

source: Parent iterator for adding folder does not reference a browser!
fr: L'itérateur parent pour ajouter des dossier ne fait pas référence à un navigateur!

source: Got invalid item when locating activated index!
fr: Reçu un élément invalide lors de la recherche d'index activé!

source: Got bad item back to delete, skipping.
fr: Reçu un mauvais élément pour supprimer, ignoré.

source: Create Folder
fr: Créer un dossier

source: Create Note
fr: Créer une note

source: Join Note
fr: Ajouter une note

source: delete
fr: supprimer

source: Collaborative text editing environment.
fr: Environnement d'édition de text collaboratif

source: Creator, Maintainer
fr: Créateur, Mainteneur

source: A KDE text-editor component could not be found; please check your KDE installation.
fr: Un module d'éditeur de texte KDE ne pouvait pas être trouvé. SVP vérifier votre installation KDE.

source: Remote Browser
fr: Navigateur distant

source: Local Browser
fr: Navigateur local

source: Users
fr: Utilisateurs

source: New Connection
fr: Nouvelle connexion

source: Create a new connection.
fr: Créer une nouvelle connection

source: Kobby settings.
fr: Configuration pour Kobby.

source: Open a new blank document.
fr: Ouvrir un nouveau document vide

source: Select a document to open.
fr: Sélectionner un document à ouvrir

source: Close active document.
fr: Fermer le document actuel

source: Open Local File - Kobby
fr: Ouvrir un fichier local - Kobby

source: Connection error: %1
fr: Erreur de connexion: %1

source: An error has occoured with the document: %1
fr: Une erreur a eu lieu dans le document: %1

source: You must connect to an infinote server before browsing collaborative documents.
fr: Vous devez vous joindre à un serveur infinote avant de naviguer des documents collaboratifs.

source: Note name:
fr: Nom de la note:

source: Create document handler called but we have invalid selection.
fr: Le gestionnaire de création de document a été appelé mais nous avons une sélection invalide.

source: Folder Name:
fr: Nom du dossier:

source: Create folder handler called but we have invalid selection.
fr: Le gestionnaire de création de dossier a été appelé mais nous avons une sélection invalide.

source: Open handler called but we have invalid selection.
fr: Le gestionnaire d'ouverture a été appelé mais nous avons une sélection invalide.

source: You are about to delete %1 files.
fr: Vous allez supprimer %1 fichiers.

source: Are you sure you want to delete this file?
fr: Voulez-vous vraiment supprimer ce fichier?

source: delete name %1
fr: supprimer le nom %1

source: New Document
fr: Nouveau document

source: New Folder
fr: Nouveau dossier

source: Open Document
fr: Ouvrir un document

source: Delete
fr: Supprimer

source: Width of the Main Window.
fr: Largeur de la fenêtre principale.

source: Height of the Main Window.
fr: Hauteur de la fenêtre principale.

source: X location of Main Window.
fr: Emplacement X de la fenêtre principale.

source: Y location of Main Window.
fr: Emplacement Y de la fenêtre principale.

source: Sizes of main horizontal splitter.
fr: Taille des separateurs horizontals principaux.

source: Show Create Connection dialog on application start.
fr: Afficher la fenêtre "Créer une connection" au lancement de Kobby.

source: Nick Name other users see.
fr: Pseudonyme vu par les autres utilisateurs.

source: Color user appears as on server.
fr: Couleur à l'utilisateur sur le serveur.

source: Hostname of local computer.
fr: Nom d'hôte de l'ordi local.

# @title:menu
source: &File
fr: &Fichier

# @title:menu
source: &Edit
fr: &Édition

source: Main Toolbar
fr: Barre d'outils principale

source: Form
fr: Formulaire

source: Plugin
fr: Module

source: Color
fr: Couleur

source: Chose a nickname and hostname which will identify you to other users.
fr: Choisir un pseudonyme et un nom d'hôte qui vous identifiront aux autres utilisateurs.

source: Setup Assistant
fr: Assistant de configuration

source: This setup assistant will guide you through the Kobby configuration.
fr: L'assistant de configuration vous guidera à travers la configuration de Kobby.

source: Show "Create Connection" dialog on start.
fr: Afficher la fenêtre "Créer une connection" au lancement de Kobby.

# NAME OF TRANSLATORS
source: Your names
fr: Ryan Kavanagh

# EMAIL OF TRANSLATORS
source: Your emails
fr: ryanakca@kubuntu.org
